ssenja/TMM737/BSP/GD32H7xx_HAL/INC/gd32h73x_75x_rcu.h
/* bits definitions */
/* RCU_CTL */
#define RCU_CTL_IRC64MADJ               BITS(0,6)                                   /*!< high speed internal oscillator clock trim adjust value */
#define RCU_CTL_IRC64MCALIB             BITS(7,15)                                  /*!< high speed internal oscillator calibration value register */
#define RCU_CTL_HXTALEN                 BIT(16)                                     /*!< external high speed oscillator enable */
#define RCU_CTL_HXTALSTB                BIT(17)                                     /*!< external crystal oscillator clock stabilization flag */
#define RCU_CTL_HXTALBPS                BIT(18)                                     /*!< external crystal oscillator clock bypass mode enable */
#define RCU_CTL_CKMEN                   BIT(19)                                     /*!< HXTAL clock monitor enable */
#define RCU_CTL_PLL0EN                  BIT(24)                                     /*!< PLL0 enable */
#define RCU_CTL_PLL0STB                 BIT(25)                                     /*!< PLL0 clock stabilization flag */
#define RCU_CTL_PLL1EN                  BIT(26)                                     /*!< PLL1 enable */
#define RCU_CTL_PLL1STB                 BIT(27)                                     /*!< PLL1 clock stabilization flag */
#define RCU_CTL_PLL2EN                  BIT(28)                                     /*!< PLL2 enable */
#define RCU_CTL_PLL2STB                 BIT(29)                                     /*!< PLL2 clock stabilization flag */
#define RCU_CTL_IRC64MEN                BIT(30)                                     /*!< IRC64M high speed oscillator enable */
#define RCU_CTL_IRC64MSTB               BIT(31)                                     /*!< IRC64M high speed internal oscillator stabilization flag */

/* RCU_PLL0 */
#define RCU_PLL0_PLL0PSC                BITS(0,5)                                   /*!< The PLL0 VCO source clock prescaler */
#define RCU_PLL0_PLL0N                  BITS(6,14)                                  /*!< The PLL0 VCO clock multi factor */
#define RCU_PLL0_PLL0P                  BITS(16,22)                                 /*!< The PLL0P output frequency division factor from PLL0 VCO clock */
#define RCU_PLL0_PLL0R                  BITS(24,30)                                 /*!< the PLL0R output frequency division factor from PLL0 VCO clock */
#define RCU_PLL0_PLLSTBSRC              BIT(31)                                     /*!< PLLs stabilization signal sources */

/* RCU_CFG0 */
#define RCU_CFG0_SCS                    BITS(0,1)                                   /*!< system clock switch */
#define RCU_CFG0_SCSS                   BITS(2,3)                                   /*!< system clock switch status */
#define RCU_CFG0_AHBPSC                 BITS(4,7)                                   /*!< AHB prescaler selection */
#define RCU_CFG0_APB1PSC                BITS(10,12)                                 /*!< APB1 prescaler selection */
#define RCU_CFG0_APB2PSC                BITS(13,15)                                 /*!< APB2 prescaler selection */
#define RCU_CFG0_RTCDIV                 BITS(16,21)                                 /*!< RTC clock divider factor */
#define RCU_CFG0_APB4PSC                BITS(24,26)                                 /*!< APB4 prescaler selection */
#define RCU_CFG0_APB3PSC                BITS(27,29)                                 /*!< APB3 prescaler selection */
#define RCU_CFG0_I2C0SEL                BITS(30,31)                                 /*!< I2C0 clock source selection */

/* RCU_INT */
#define RCU_INT_IRC32KSTBIF             BIT(0)                                      /*!< IRC32K stabilization interrupt flag */
#define RCU_INT_LXTALSTBIF              BIT(1)                                      /*!< LXTAL stabilization interrupt flag */
#define RCU_INT_IRC64MSTBIF             BIT(2)                                      /*!< IRC64M stabilization interrupt flag */
#define RCU_INT_HXTALSTBIF              BIT(3)                                      /*!< HXTAL stabilization interrupt flag */
#define RCU_INT_PLL0STBIF               BIT(4)                                      /*!< PLL0 stabilization interrupt flag */
#define RCU_INT_PLL1STBIF               BIT(5)                                      /*!< PLL1 stabilization interrupt flag */
#define RCU_INT_PLL2STBIF               BIT(6)                                      /*!< PLL2 stabilization interrupt flag */
#define RCU_INT_CKMIF                   BIT(7)                                      /*!< HXTAL clock stuck interrupt flag */
#define RCU_INT_IRC32KSTBIE             BIT(8)                                      /*!< IRC32K stabilization interrupt enable */
#define RCU_INT_LXTALSTBIE              BIT(9)                                      /*!< LXTAL stabilization interrupt enable */
#define RCU_INT_IRC64MSTBIE             BIT(10)                                     /*!< IRC64M stabilization interrupt enable */
#define RCU_INT_HXTALSTBIE              BIT(11)                                     /*!< HXTAL stabilization interrupt enable */
#define RCU_INT_PLL0STBIE               BIT(12)                                     /*!< PLL0 stabilization interrupt enable */
#define RCU_INT_PLL1STBIE               BIT(13)                                     /*!< PLL1 stabilization interrupt enable */
#define RCU_INT_PLL2STBIE               BIT(14)                                     /*!< PLL2 stabilization interrupt enable */
#define RCU_INT_IRC32KSTBIC             BIT(16)                                     /*!< IRC32K stabilization interrupt clear */
#define RCU_INT_LXTALSTBIC              BIT(17)                                     /*!< LXTAL stabilization interrupt clear */
#define RCU_INT_IRC64MSTBIC             BIT(18)                                     /*!< IRC64M stabilization interrupt clear */
#define RCU_INT_HXTALSTBIC              BIT(19)                                     /*!< HXTAL stabilization interrupt clear */
#define RCU_INT_PLL0STBIC               BIT(20)                                     /*!< PLL0 stabilization interrupt clear */
#define RCU_INT_PLL1STBIC               BIT(21)                                     /*!< PLL1 stabilization interrupt clear */
#define RCU_INT_PLL2STBIC               BIT(22)                                     /*!< PLL2 stabilization interrupt clear */
#define RCU_INT_CKMIC                   BIT(23)                                     /*!< HXTAL clock stuck interrupt clear */
#define RCU_INT_LPIRC4MSTBIF            BIT(24)                                     /*!< LPIRC4M stabilization interrupt flag */
#define RCU_INT_LPIRC4MSTBIE            BIT(25)                                     /*!< LPIRC4M stabilization interrupt enable */
#define RCU_INT_LPIRC4MSTBIC            BIT(26)                                     /*!< LPIRC4M stabilization interrupt clear */
#define RCU_INT_LCKMIF                  BIT(27)                                     /*!< LXTAL clock stuck interrupt flag */
#define RCU_INT_LCKMIC                  BIT(28)                                     /*!< LXTAL clock stuck interrupt clear */

/* RCU_AHB1RST */
#define RCU_AHB1RST_ENET1RST            BIT(0)                                      /*!< ENET1 reset */
#define RCU_AHB1RST_USBHS0RST           BIT(14)                                     /*!< USBHS0 reset */
#define RCU_AHB1RST_DMA0RST             BIT(21)                                     /*!< DMA0 reset */
#define RCU_AHB1RST_DMA1RST             BIT(22)                                     /*!< DMA1 reset */
#define RCU_AHB1RST_DMAMUXRST           BIT(23)                                     /*!< DMAMUX reset */
#define RCU_AHB1RST_ENET0RST            BIT(25)                                     /*!< ENET0 reset */
#define RCU_AHB1RST_USBHS1RST           BIT(29)                                     /*!< USBHS1 reset */

/* RCU_AHB2RST */
#define RCU_AHB2RST_DCIRST              BIT(0)                                      /*!< DCI reset */
#define RCU_AHB2RST_FACRST              BIT(1)                                      /*!< FAC reset */
#define RCU_AHB2RST_SDIO1RST            BIT(2)                                      /*!< SDIO1 reset */
#define RCU_AHB2RST_CAURST              BIT(3)                                      /*!< CAU reset */
#define RCU_AHB2RST_HAURST              BIT(4)                                      /*!< HAU reset */
#define RCU_AHB2RST_TRNGRST             BIT(6)                                      /*!< TRNG reset */
#define RCU_AHB2RST_TMURST              BIT(7)                                      /*!< TMU reset */

/* RCU_AHB3RST */
#define RCU_AHB3RST_EXMCRST             BIT(0)                                      /*!< EXMC reset */
#define RCU_AHB3RST_IPARST              BIT(1)                                      /*!< IPA reset */
#define RCU_AHB3RST_SDIO0RST            BIT(2)                                      /*!< SDIO0 reset */
#define RCU_AHB3RST_MDMARST             BIT(3)                                      /*!< MDMA reset */
#define RCU_AHB3RST_OSPIMRST            BIT(4)                                      /*!< OSPIM reset */
#define RCU_AHB3RST_OSPI0RST            BIT(5)                                      /*!< OSPI0 reset */
#define RCU_AHB3RST_OSPI1RST            BIT(6)                                      /*!< OSPI1 reset */
#define RCU_AHB3RST_RTDEC0RST           BIT(8)                                      /*!< RTDEC0 reset */
#define RCU_AHB3RST_RTDEC1RST           BIT(9)                                      /*!< RTDEC1 reset */

/* RCU_AHB4RST */
#define RCU_AHB4RST_PARST               BIT(0)                                      /*!< GPIO port A reset */
#define RCU_AHB4RST_PBRST               BIT(1)                                      /*!< GPIO port B reset */
#define RCU_AHB4RST_PCRST               BIT(2)                                      /*!< GPIO port C reset */
#define RCU_AHB4RST_PDRST               BIT(3)                                      /*!< GPIO port D reset */
#define RCU_AHB4RST_PERST               BIT(4)                                      /*!< GPIO port E reset */
#define RCU_AHB4RST_PFRST               BIT(5)                                      /*!< GPIO port F reset */
#define RCU_AHB4RST_PGRST               BIT(6)                                      /*!< GPIO port G reset */
#define RCU_AHB4RST_PHRST               BIT(7)                                      /*!< GPIO port H reset */
#define RCU_AHB4RST_PJRST               BIT(8)                                      /*!< GPIO port J reset */
#define RCU_AHB4RST_PKRST               BIT(9)                                      /*!< GPIO port K reset */
#define RCU_AHB4RST_CRCRST              BIT(14)                                     /*!< CRC reset */
#define RCU_AHB4RST_HWSEMRST            BIT(15)                                     /*!< HWSEM reset */

/* RCU_APB1RST */
#define RCU_APB1RST_TIMER1RST           BIT(0)                                      /*!< TIMER1 reset */
#define RCU_APB1RST_TIMER2RST           BIT(1)                                      /*!< TIMER2 reset */
#define RCU_APB1RST_TIMER3RST           BIT(2)                                      /*!< TIMER3 reset */
#define RCU_APB1RST_TIMER4RST           BIT(3)                                      /*!< TIMER4 reset */
#define RCU_APB1RST_TIMER5RST           BIT(4)                                      /*!< TIMER5 reset */
#define RCU_APB1RST_TIMER6RST           BIT(5)                                      /*!< TIMER6 reset */
#define RCU_APB1RST_TIMER22RST          BIT(6)                                      /*!< TIMER22 reset */
#define RCU_APB1RST_TIMER23RST          BIT(7)                                      /*!< TIMER23 reset */
#define RCU_APB1RST_TIMER30RST          BIT(8)                                      /*!< TIMER30 reset */
#define RCU_APB1RST_TIMER31RST          BIT(9)                                      /*!< TIMER31 reset */
#define RCU_APB1RST_TIMER50RST          BIT(10)                                     /*!< TIMER50 reset */
#define RCU_APB1RST_TIMER51RST          BIT(11)                                     /*!< TIMER51 reset */
#define RCU_APB1RST_RSPDIFRST           BIT(13)                                     /*!< RSPDIF reset */
#define RCU_APB1RST_SPI1RST             BIT(14)                                     /*!< SPI1 reset */
#define RCU_APB1RST_SPI2RST             BIT(15)                                     /*!< SPI2 reset */
#define RCU_APB1RST_MDIORST             BIT(16)                                     /*!< MDIO reset */
#define RCU_APB1RST_USART1RST           BIT(17)                                     /*!< USART1 reset */
#define RCU_APB1RST_USART2RST           BIT(18)                                     /*!< USART2 reset */
#define RCU_APB1RST_UART3RST            BIT(19)                                     /*!< UART3 reset */
#define RCU_APB1RST_UART4RST            BIT(20)                                     /*!< UART4 reset */
#define RCU_APB1RST_I2C0RST             BIT(21)                                     /*!< I2C0 reset */
#define RCU_APB1RST_I2C1RST             BIT(22)                                     /*!< I2C1 reset */
#define RCU_APB1RST_I2C2RST             BIT(23)                                     /*!< I2C2 reset */
#define RCU_APB1RST_I2C3RST             BIT(24)                                     /*!< I2C3 reset */
#define RCU_APB1RST_CTCRST              BIT(27)                                     /*!< CTC reset */
#define RCU_APB1RST_DACHOLDRST          BIT(28)                                     /*!< DAC hold clock reset */
#define RCU_APB1RST_DACRST              BIT(29)                                     /*!< DAC reset */
#define RCU_APB1RST_UART6RST            BIT(30)                                     /*!< UART6 reset */
#define RCU_APB1RST_UART7RST            BIT(31)                                     /*!< UART7 reset */

/* RCU_APB2RST */
#define RCU_APB2RST_TIMER0RST           BIT(0)                                      /*!< TIMER0 reset */
#define RCU_APB2RST_TIMER7RST           BIT(1)                                      /*!< TIMER7 reset */
#define RCU_APB2RST_USART0RST           BIT(4)                                      /*!< USART0 reset */
#define RCU_APB2RST_USART5RST           BIT(5)                                      /*!< USART5 reset */
#define RCU_APB2RST_ADC0RST             BIT(8)                                      /*!< ADC0 reset */
#define RCU_APB2RST_ADC1RST             BIT(9)                                      /*!< ADC1 reset */
#define RCU_APB2RST_ADC2RST             BIT(10)                                     /*!< ADC2 reset */
#define RCU_APB2RST_SPI0RST             BIT(12)                                     /*!< SPI0 reset */
#define RCU_APB2RST_SPI3RST             BIT(13)                                     /*!< SPI3 reset */
#define RCU_APB2RST_TIMER14RST          BIT(16)                                     /*!< TIMER14 reset */
#define RCU_APB2RST_TIMER15RST          BIT(17)                                     /*!< TIMER15 reset */
#define RCU_APB2RST_TIMER16RST          BIT(18)                                     /*!< TIMER15 reset */
#define RCU_APB2RST_HPDFRST             BIT(19)                                     /*!< HPDF reset */
#define RCU_APB2RST_SPI4RST             BIT(20)                                     /*!< SPI4 reset */
#define RCU_APB2RST_SPI5RST             BIT(21)                                     /*!< SPI5 reset */
#define RCU_APB2RST_SAI0RST             BIT(22)                                     /*!< SAI0 reset */
#define RCU_APB2RST_SAI1RST             BIT(23)                                     /*!< SAI1 reset */
#define RCU_APB2RST_SAI2RST             BIT(24)                                     /*!< SAI2 reset */
#define RCU_APB2RST_TIMER40RST          BIT(25)                                     /*!< TIMER40 reset */
#define RCU_APB2RST_TIMER41RST          BIT(26)                                     /*!< TIMER41 reset */
#define RCU_APB2RST_TIMER42RST          BIT(27)                                     /*!< TIMER42 reset */
#define RCU_APB2RST_TIMER43RST          BIT(28)                                     /*!< TIMER43 reset */
#define RCU_APB2RST_TIMER44RST          BIT(29)                                     /*!< TIMER44 reset */
#define RCU_APB2RST_EDOUTRST            BIT(30)                                     /*!< EDOUT reset */
#define RCU_APB2RST_TRIGSELRST          BIT(31)                                     /*!< TRIGSEL reset */

/* RCU_APB3RST */
#define RCU_APB3RST_TLIRST              BIT(0)                                      /*!< TLI reset */
#define RCU_APB3RST_WWDGTRST            BIT(1)                                      /*!< WWDGT reset */

