ssenja/TMM737/BSP/GD32H7xx_HAL/INC/gd32h73x_75x_rcu.h
/* CANx(x=0,1,2) clock source selection */
#define CFG1_CAN0SEL(regval)         (BITS(8,9) & ((uint32_t)(regval) << 8U))
#define RCU_CANSRC_HXTAL             CFG1_CAN0SEL(0)                                /*!< CK_CAN select CK_HXTAL */
#define RCU_CANSRC_APB2              CFG1_CAN0SEL(1)                                /*!< CK_CAN select CK_APB2 */
#define RCU_CANSRC_APB2_DIV2         CFG1_CAN0SEL(2)                                /*!< CK_CAN select CK_APB2/2 */
#define RCU_CANSRC_IRC64MDIV         CFG1_CAN0SEL(3)                                /*!< CK_CAN select CK_IRC64MDIV */

/* RSPDIF clock selection */
#define CFG1_RSPDIFSEL(regval)       (BITS(4,5) & ((uint32_t)(regval) << 4U))
#define RCU_RSPDIFSRC_PLL0Q          CFG1_RSPDIFSEL(0)                              /*!< CK_RSPDIF select CK_PLL0Q */
#define RCU_RSPDIFSRC_PLL1R          CFG1_RSPDIFSEL(1)                              /*!< CK_RSPDIF select CK_PLL1R */
#define RCU_RSPDIFSRC_PLL2R          CFG1_RSPDIFSEL(2)                              /*!< CK_RSPDIF select CK_PLL2R */
#define RCU_RSPDIFSRC_IRC64MDIV      CFG1_RSPDIFSEL(3)                              /*!< CK_RSPDIF select CK_IRC64MDIV */

/* EXMC clock selection */
#define CFG4_EXMCSEL(regval)         (BITS(8,9) & ((uint32_t)(regval) << 8U))
#define RCU_EXMCSRC_AHB              CFG4_EXMCSEL(0)                                /*!< CK_EXMC select CK_AHB */
#define RCU_EXMCSRC_PLL0Q            CFG4_EXMCSEL(1)                                /*!< CK_EXMC select CK_PLL0Q */
#define RCU_EXMCSRC_PLL1R            CFG4_EXMCSEL(2)                                /*!< CK_EXMC select CK_PLL1R */
#define RCU_EXMCSRC_PER              CFG4_EXMCSEL(3)                                /*!< CK_EXMC select CK_PER */

/* SPIx(x=0,1,2) clock source selecion */
#define CFG5_SPI0SEL(regval)         (BITS(0,2) & ((uint32_t)(regval) << 0U))
#define RCU_SPISRC_PLL0Q             CFG5_SPI0SEL(0)                                /*!< CK_SPI select CK_PLL0Q */
#define RCU_SPISRC_PLL1P             CFG5_SPI0SEL(1)                                /*!< CK_SPI select CK_PLL1P */
#define RCU_SPISRC_PLL2P             CFG5_SPI0SEL(2)                                /*!< CK_SPI select CK_PLL2P */
#define RCU_SPISRC_I2S_CKIN          CFG5_SPI0SEL(3)                                /*!< CK_SPI select I2S_CKIN */
#define RCU_SPISRC_PER               CFG5_SPI0SEL(4)                                /*!< CK_SPI select CK_PER */

/* SPIx(x=3,4,5) clock source selection */
#define CFG5_SPI3SEL(regval)         (BITS(12,14) & ((uint32_t)(regval) << 12U))
#define RCU_SPISRC_APB2              CFG5_SPI3SEL(0)                                /*!< CK_SPI select CK_APB2 */
#define RCU_SPISRC_PLL1Q             CFG5_SPI3SEL(1)                                /*!< CK_SPI select CK_PLL1Q */
#define RCU_SPISRC_PLL2Q             CFG5_SPI3SEL(2)                                /*!< CK_SPI select CK_PLL2Q */
#define RCU_SPISRC_IRC64MDIV         CFG5_SPI3SEL(3)                                /*!< CK_SPI select CK_IRC64MDIV */
#define RCU_SPISRC_LPIRC4M           CFG5_SPI3SEL(4)                                /*!< CK_SPI select CK_LPIRC4M */
#define RCU_SPISRC_HXTAL             CFG5_SPI3SEL(5)                                /*!< CK_SPI select CK_HXTAL */
#define RCU_SPI5SRC_I2S_CKIN         CFG5_SPI3SEL(6)                                /*!< CK_SPI select I2S_CKIN */

/* SDIOx(x=0,1) clock source selection */
#define RCU_SDIO0SRC_PLL0Q           (uint32_t)(0X00000000U)                        /*!< CK_SDIO0 select CK_PLL0Q */
#define RCU_SDIO0SRC_PLL1R           RCU_CFG4_SDIO0SEL                              /*!< CK_SDIO0 select CK_PLL1R */
#define RCU_SDIO1SRC_PLL0Q           (uint32_t)(0X00000000U)                        /*!< CK_SDIO1 select CK_PLL0Q */
#define RCU_SDIO1SRC_PLL1R           RCU_CFG3_SDIO1SEL                              /*!< CK_SDIO1 select CK_PLL1R */

/* Deep-sleep wakeup system clock source selection */
#define RCU_DSPWUSSEL_IRC64MDIV      (uint32_t)(0X00000000U)                        /*!< CK_IRC64MDIV is selected as wake up system clock from deep-sleep mode */
#define RCU_DSPWUSSEL_LPIRC4M        RCU_CFG3_DSPWUSSEL                             /*!< CK_LPIRC4M is selected as wake up system clock from deep-sleep mode */

/* ADCx(x=0,1,2) clock source selection */
#define CFG3_ADC0SEL(regval)         (BITS(26,27) & ((uint32_t)(regval) << 26U))
#define RCU_ADCSRC_PLL1P             CFG3_ADC0SEL(0)                                /*!< CK_ADC select CK_PLL1P */
#define RCU_ADCSRC_PLL2R             CFG3_ADC0SEL(1)                                /*!< CK_ADC select CK_PLL2R */
#define RCU_ADCSRC_PER               CFG3_ADC0SEL(2)                                /*!< CK_ADC select CK_PER */

/* SAIx(x=0,1) clock source selection */
#define CFG2_SAI0SEL(regval)         (BITS(16,18) & ((uint32_t)(regval) << 16U))
#define RCU_SAISRC_PLL0Q             CFG2_SAI0SEL(0)                                /*!< CK_SAI0/1 select CK_PLL0Q */
#define RCU_SAISRC_PLL1P             CFG2_SAI0SEL(1)                                /*!< CK_SAI0/1 select CK_PLL1P */
#define RCU_SAISRC_PLL2P             CFG2_SAI0SEL(2)                                /*!< CK_SAI0/1 select CK_PLL2P */
#define RCU_SAISRC_I2S_CKIN          CFG2_SAI0SEL(3)                                /*!< CK_SAI0/1 select I2S_CKIN */
#define RCU_SAISRC_PER               CFG2_SAI0SEL(4)                                /*!< CK_SAI0/1 select CK_PER */

/* SAI2Bx(x=0,1) clock source selection */
#define CFG2_SAI2B0SEL(regval)       (BITS(24,26) & ((uint32_t)(regval) << 24U))
#define RCU_SAI2BSRC_PLL0Q           CFG2_SAI2B0SEL(0)                              /*!< SAI2 block0/1 select CK_PLL0Q */
#define RCU_SAI2BSRC_PLL1P           CFG2_SAI2B0SEL(1)                              /*!< SAI2 block0/1 select CK_PLL1P */
#define RCU_SAI2BSRC_PLL2P           CFG2_SAI2B0SEL(2)                              /*!< SAI2 block0/1 select CK_PLL2P */
#define RCU_SAI2BSRC_I2S_CKIN        CFG2_SAI2B0SEL(3)                              /*!< SAI2 block0/1 select I2S_CKIN */
#define RCU_SAI2BSRC_PER             CFG2_SAI2B0SEL(4)                              /*!< SAI2 block0/1 select CK_PER */
#define RCU_SAI2BSRC_RSPDIF_SYMB     CFG2_SAI2B0SEL(5)                              /*!< SAI2 block0/1 select CK_RSPDIF_SYMB */

/* HPDF clock source selection */
#define RCU_HPDFSRC_APB2             (uint32_t)(0X00000000U)                        /*!< CK_HPDF select CK_APB2 */
#define RCU_HPDFSRC_AHB              RCU_CFG1_HPDFSEL                               /*!< CK_HPDF select CK_AHB */

/* PER clock selection */
#define CFG1_PERSEL(regval)          (BITS(14,15) & ((uint32_t)(regval) << 14U))
#define RCU_PERSRC_IRC64MDIV         CFG1_PERSEL(0)                                 /*!< CK_PER select CK_IRC64MDIV */
#define RCU_PERSRC_LPIRC4M           CFG1_PERSEL(1)                                 /*!< CK_PER select CK_LPIRC4M */
#define RCU_PERSRC_HXTAL             CFG1_PERSEL(2)                                 /*!< CK_PER select CK_HXTAL */

