ssenja/TMM737/BSP/GD32H7xx_HAL/INC/gd32h73x_75x_rcu.h
/* The PLL0 VCO clock multiplication factor */
#define RCU_PLL0N_MUL_MIN            ((uint32_t)9U)                                 /*!< PLL0N_MUL min value */
#define RCU_PLL0N_MUL_MAX            ((uint32_t)512U)                               /*!< PLL0N_MUL max value */

/* The PLL0P output frequency division factor from PLL0 VCO clock */
#define RCU_PLL0P_DIV_MIN            ((uint32_t)1U)                                 /*!< PLL0P_DIV min value */
#define RCU_PLL0P_DIV_MAX            ((uint32_t)128U)                               /*!< PLL0P_DIV max value */

/* The PLL0R output frequency division factor from PLL0 VCO clock */
#define RCU_PLL0R_DIV_MIN            ((uint32_t)1U)                                 /*!< PLL0R_DIV min value */
#define RCU_PLL0R_DIV_MAX            ((uint32_t)128U)                               /*!< PLL0R_DIV max value */

/* The PLL0Q output frequency division factor from PLL0 VCO clock */
#define RCU_PLL0Q_DIV_MIN            ((uint32_t)1U)                                 /*!< PLL0Q_DIV min value */
#define RCU_PLL0Q_DIV_MAX            ((uint32_t)128U)                               /*!< PLL0Q_DIV max value */

/* PLL Clock Source Selection  */
#define PLLALL_PLLSEL(regval)        (BITS(16,17) & ((uint32_t)(regval) << 16U))
#define RCU_PLLSRC_IRC64MDIV         PLLALL_PLLSEL(0)                               /*!< IRC64MDIV clock selected as source clock of PLL0, PLL1, PLL2 */
#define RCU_PLLSRC_LPIRC4M           PLLALL_PLLSEL(1)                               /*!< LPIRC4M  clock selected as source clock of PLL0, PLL1, PLL2 */
#define RCU_PLLSRC_HXTAL             PLLALL_PLLSEL(2)                               /*!< HXTAL clock selected as source clock of PLL0, PLL1, PLL2 */

#define CHECK_PLL0_PSC_VALID(val)    (((val) >= RCU_PLL0PSC_DIV_MIN) && ((val) <= RCU_PLL0PSC_DIV_MAX))
#define CHECK_PLL0_N_VALID(val)      (((val) >= RCU_PLL0N_MUL_MIN) && ((val) <= RCU_PLL0N_MUL_MAX))
#define CHECK_PLL0_P_VALID(val)      (((val) >= RCU_PLL0P_DIV_MIN) && ((val) <= RCU_PLL0P_DIV_MAX))
#define CHECK_PLL0_Q_VALID(val)      (((val) >= RCU_PLL0Q_DIV_MIN) && ((val) <= RCU_PLL0Q_DIV_MAX))
#define CHECK_PLL0_R_VALID(val)      (((val) >= RCU_PLL0R_DIV_MIN) && ((val) <= RCU_PLL0R_DIV_MAX))

/* RCU_BDCTL register bit define */
/* LXTAL drive capability */
#define BDCTL_LXTALDRI(regval)       (BITS(3,4) & ((uint32_t)(regval) << 3U))
#define RCU_LXTAL_LOWDRI             BDCTL_LXTALDRI(0)                              /*!< lower driving capability */
#define RCU_LXTAL_MED_LOWDRI         BDCTL_LXTALDRI(1)                              /*!< medium low driving capability */
#define RCU_LXTAL_MED_HIGHDRI        BDCTL_LXTALDRI(2)                              /*!< medium high driving capability */
#define RCU_LXTAL_HIGHDRI            BDCTL_LXTALDRI(3)                              /*!< higher driving capability */

/* RTC clock entry selection */
#define BDCTL_RTCSRC(regval)         (BITS(8,9) & ((uint32_t)(regval) << 8U))
#define RCU_RTCSRC_NONE              BDCTL_RTCSRC(0)                                /*!< no clock selected */
#define RCU_RTCSRC_LXTAL             BDCTL_RTCSRC(1)                                /*!< RTC source clock select LXTAL  */
#define RCU_RTCSRC_IRC32K            BDCTL_RTCSRC(2)                                /*!< RTC source clock select IRC32K */
#define RCU_RTCSRC_HXTAL_DIV_RTCDIV  BDCTL_RTCSRC(3)                                /*!< RTC source clock select HXTAL/RTCDIV */

/* RCU_PLL1 register bit define */
/* The PLL1 VCO source clock prescaler */
#define RCU_PLL1PSC_DIV_MIN          ((uint32_t)1U)                                 /*!< PLL1PSC_DIV min value */
#define RCU_PLL1PSC_DIV_MAX          ((uint32_t)63U)                                /*!< PLL1PSC_DIV max value */

/* The PLL1 VCO clock multiplication factor */
#define RCU_PLL1N_MUL_MIN            ((uint32_t)9U)                                 /*!< PLL1N_MUL min value */
#define RCU_PLL1N_MUL_MAX            ((uint32_t)512U)                               /*!< PLL1N_MUL max value */

/* The PLL1P output frequency division factor from PLL1 VCO clock */
#define RCU_PLL1P_DIV_MIN            ((uint32_t)1U)                                 /*!< PLL1P_DIV min value */
#define RCU_PLL1P_DIV_MAX            ((uint32_t)128U)                               /*!< PLL1P_DIV max value */

/* The PLL1Q output frequency division factor from PLL1 VCO clock */
#define RCU_PLL1Q_DIV_MIN            ((uint32_t)1U)                                 /*!< PLL1Q_DIV min value */
#define RCU_PLL1Q_DIV_MAX            ((uint32_t)128U)                               /*!< PLL1Q_DIV max value */

/* The PLL1R output frequency division factor from PLL1 VCO clock */
#define RCU_PLL1R_DIV_MIN            ((uint32_t)1U)                                 /*!< PLL1R_DIV min value */
#define RCU_PLL1R_DIV_MAX            ((uint32_t)128U)                               /*!< PLL1R_DIV max value */

/* RCU_PLL2 register bit define */
/* The PLL2 VCO source clock prescaler */
#define RCU_PLL2PSC_DIV_MIN          ((uint32_t)1U)                                 /*!< PLL2PSC_DIV min value */
#define RCU_PLL2PSC_DIV_MAX          ((uint32_t)63U)                                /*!< PLL2PSC_DIV max value */

/* The PLL2 VCO clock multi factor */
#define RCU_PLL2N_MUL_MIN            ((uint32_t)9U)                                 /*!< PLL2N_MUL min value */
#define RCU_PLL2N_MUL_MAX            ((uint32_t)512U)                               /*!< PLL2N_MUL max value */

/* The PLL2P output frequency division factor from PLL2 VCO clock */
#define RCU_PLL2P_DIV_MIN            ((uint32_t)1U)                                 /*!< PLL2P_DIV min value */
#define RCU_PLL2P_DIV_MAX            ((uint32_t)128U)                               /*!< PLL2P_DIV max value */

/* The PLL2Q output frequency division factor from PLL2 VCO clock */
#define RCU_PLL2Q_DIV_MIN            ((uint32_t)1U)                                 /*!< PLL2Q_DIV min value */
#define RCU_PLL2Q_DIV_MAX            ((uint32_t)128U)                               /*!< PLL2Q_DIV max value */

/* The PLL2R output frequency division factor from PLL2 VCO clock */
#define RCU_PLL2R_DIV_MIN            ((uint32_t)1U)                                 /*!< PLL2R_DIV min value */
#define RCU_PLL2R_DIV_MAX            ((uint32_t)128U)                               /*!< PLL2R_DIV max value */

#define CHECK_PLL1_PSC_VALID(val)    (((val) >= RCU_PLL1PSC_DIV_MIN) && ((val) <= RCU_PLL1PSC_DIV_MAX))
#define CHECK_PLL1_N_VALID(val)      (((val) >= RCU_PLL1N_MUL_MIN) && ((val) <= RCU_PLL1N_MUL_MAX))
#define CHECK_PLL1_P_VALID(val)      (((val) >= RCU_PLL1P_DIV_MIN) && ((val) <= RCU_PLL1P_DIV_MAX))
#define CHECK_PLL1_Q_VALID(val)      (((val) >= RCU_PLL1Q_DIV_MIN) && ((val) <= RCU_PLL1Q_DIV_MAX))
#define CHECK_PLL1_R_VALID(val)      (((val) >= RCU_PLL1R_DIV_MIN) && ((val) <= RCU_PLL1R_DIV_MAX))

#define CHECK_PLL2_PSC_VALID(val)    (((val) >= RCU_PLL2PSC_DIV_MIN) && ((val) <= RCU_PLL2PSC_DIV_MAX))
#define CHECK_PLL2_N_VALID(val)      (((val) >= (RCU_PLL2N_MUL_MIN)) && ((val) <= RCU_PLL2N_MUL_MAX))
#define CHECK_PLL2_P_VALID(val)      (((val) >= RCU_PLL2P_DIV_MIN) && ((val) <= RCU_PLL2P_DIV_MAX))
#define CHECK_PLL2_Q_VALID(val)      (((val) >= RCU_PLL2Q_DIV_MIN) && ((val) <= RCU_PLL2Q_DIV_MAX))
#define CHECK_PLL2_R_VALID(val)      (((val) >= RCU_PLL2R_DIV_MIN) && ((val) <= RCU_PLL2R_DIV_MAX))

/* PLL0 input clock range */
#define PLLALL_PLL0RNG(regval)        (BITS(0,1) & ((uint32_t)(regval) << 0U))
#define RCU_PLL0RNG_1M_2M             PLLALL_PLL0RNG(0)                             /*!< PLL0 input clock frequency: 1-2MHz */
#define RCU_PLL0RNG_2M_4M             PLLALL_PLL0RNG(1)                             /*!< PLL0 input clock frequency: 2-4MHz */
#define RCU_PLL0RNG_4M_8M             PLLALL_PLL0RNG(2)                             /*!< PLL0 input clock frequency: 4-8MHz */
#define RCU_PLL0RNG_8M_16M            PLLALL_PLL0RNG(3)                             /*!< PLL0 input clock frequency: 8-16MHz */

/* PLL1 input clock range */
#define PLLALL_PLL1RNG(regval)       (BITS(4,5) & ((uint32_t)(regval) << 4U))
#define RCU_PLL1RNG_1M_2M            PLLALL_PLL1RNG(0)                              /*!< PLL1 input clock frequency: 1-2MHz */
#define RCU_PLL1RNG_2M_4M            PLLALL_PLL1RNG(1)                              /*!< PLL1 input clock frequency: 2-4MHz */
#define RCU_PLL1RNG_4M_8M            PLLALL_PLL1RNG(2)                              /*!< PLL1 input clock frequency: 4-8MHz */
#define RCU_PLL1RNG_8M_16M           PLLALL_PLL1RNG(3)                              /*!< PLL1 input clock frequency: 8-16MHz */

/* PLL2 input clock range */
#define PLLALL_PLL2RNG(regval)       (BITS(8,9) & ((uint32_t)(regval) << 8U))
#define RCU_PLL2RNG_1M_2M            PLLALL_PLL2RNG(0)                              /*!< PLL2 input clock frequency: 1-2MHz */
#define RCU_PLL2RNG_2M_4M            PLLALL_PLL2RNG(1)                              /*!< PLL2 input clock frequency: 2-4MHz */
#define RCU_PLL2RNG_4M_8M            PLLALL_PLL2RNG(2)                              /*!< PLL2 input clock frequency: 4-8MHz */
#define RCU_PLL2RNG_8M_16M           PLLALL_PLL2RNG(3)                              /*!< PLL2 input clock frequency: 8-16MHz */

