ssenja/TMM737/BSP/GD32H7xx_HAL/INC/gd32h73x_75x_rcu.h
/* PLL0 VCO selection */
#define RCU_PLL0VCO_192M_836M        ((uint32_t)0x00000000U)                        /*!< PLL0 select wide VCO, range: 192-836MHz */
#define RCU_PLL0VCO_150M_420M        RCU_PLLALL_PLL0VCOSEL                          /*!< PLL0 select narrow VCO, range: 150-420MHz */

/* PLL1 VCO selection */
#define RCU_PLL1VCO_192M_836M        ((uint32_t)0x00000000U)                        /*!< PLL1 select wide VCO, range: 192-836MHz */
#define RCU_PLL1VCO_150M_420M        RCU_PLLALL_PLL1VCOSEL                          /*!< PLL1 select narrow VCO, range: 150-420MHz */

/* PLL2 VCO selection */
#define RCU_PLL2VCO_192M_836M        ((uint32_t)0x00000000U)                        /*!< PLL2 select wide VCO, range: 192-836MHz */
#define RCU_PLL2VCO_150M_420M        RCU_PLLALL_PLL2VCOSEL                          /*!< PLL2 select narrow VCO, range: 150-420MHz */

/* RCU_ADDCTL0 register bit define */
/* 48MHz clock selection */
#define RCU_CK48MSRC_PLL48M          ((uint32_t)0x00000000U)                        /*!< CK48M source clock select PLL48M */
#define RCU_CK48MSRC_IRC48M          RCU_ADDCTL0_CK48MSEL                           /*!< CK48M source clock select IRC48M */

/* PLL48M clock selection */
#define RCU_PLL48MSRC_PLL0Q           ((uint32_t)0x00000000U)                       /*!< PLL48M source clock select PLL0Q */
#define RCU_PLL48MSRC_PLL2P          RCU_ADDCTL0_PLL48MSEL                          /*!< PLL48M source clock select PLL2P */

/* USBHS clock selection */
#define RCU_USBHSSEL_48M             ((uint32_t)0x00000000U)                        /*!< 48M selected as USBHS source clock */
#define RCU_USBHSSEL_60M             RCU_USBCLKCTL_USBHS0SEL                        /*!< 60M selected as USBHS source clock */

/* PLLUSBHSPRE clock selection */
#define RCU_PLLUSBHSPRE_HXTAL        ((uint32_t)0x00000000U)                        /*!< CK_HATAL selected as PLLUSBHS source clock */
#define RCU_PLLUSBHSPRE_IRC48M       RCU_USBCLKCTL_PLLUSBHS0PRESEL                  /*!< CK_IRC48M selected as PLLUSBHS source clock */

/* PLLUSBHSPREDV division factor */
#define PLLUSBCFG_PLLUSBHSPREDV(regval)   (BITS(0,3) & ((uint32_t)(regval) << 0U))
#define RCU_PLLUSBHSPRE_DIV1              PLLUSBCFG_PLLUSBHSPREDV(1)                /*!< PLLUSBHSPREDV input source clock divided by 1 */
#define RCU_PLLUSBHSPRE_DIV2              PLLUSBCFG_PLLUSBHSPREDV(2)                /*!< PLLUSBHSPREDV input source clock divided by 2 */
#define RCU_PLLUSBHSPRE_DIV3              PLLUSBCFG_PLLUSBHSPREDV(3)                /*!< PLLUSBHSPREDV input source clock divided by 3 */
#define RCU_PLLUSBHSPRE_DIV4              PLLUSBCFG_PLLUSBHSPREDV(4)                /*!< PLLUSBHSPREDV input source clock divided by 4 */
#define RCU_PLLUSBHSPRE_DIV5              PLLUSBCFG_PLLUSBHSPREDV(5)                /*!< PLLUSBHSPREDV input source clock divided by 5 */
#define RCU_PLLUSBHSPRE_DIV6              PLLUSBCFG_PLLUSBHSPREDV(6)                /*!< PLLUSBHSPREDV input source clock divided by 6 */
#define RCU_PLLUSBHSPRE_DIV7              PLLUSBCFG_PLLUSBHSPREDV(7)                /*!< PLLUSBHSPREDV input source clock divided by 7 */
#define RCU_PLLUSBHSPRE_DIV8              PLLUSBCFG_PLLUSBHSPREDV(8)                /*!< PLLUSBHSPREDV input source clock divided by 8 */
#define RCU_PLLUSBHSPRE_DIV9              PLLUSBCFG_PLLUSBHSPREDV(9)                /*!< PLLUSBHSPREDV input source clock divided by 9 */
#define RCU_PLLUSBHSPRE_DIV10             PLLUSBCFG_PLLUSBHSPREDV(10)               /*!< PLLUSBHSPREDV input source clock divided by 10 */
#define RCU_PLLUSBHSPRE_DIV11             PLLUSBCFG_PLLUSBHSPREDV(11)               /*!< PLLUSBHSPREDV input source clock divided by 11 */
#define RCU_PLLUSBHSPRE_DIV12             PLLUSBCFG_PLLUSBHSPREDV(12)               /*!< PLLUSBHSPREDV input source clock divided by 12 */
#define RCU_PLLUSBHSPRE_DIV13             PLLUSBCFG_PLLUSBHSPREDV(13)               /*!< PLLUSBHSPREDV input source clock divided by 13 */
#define RCU_PLLUSBHSPRE_DIV14             PLLUSBCFG_PLLUSBHSPREDV(14)               /*!< PLLUSBHSPREDV input source clock divided by 14 */
#define RCU_PLLUSBHSPRE_DIV15             PLLUSBCFG_PLLUSBHSPREDV(15)               /*!< PLLUSBHSPREDV input source clock divided by 15 */

/* USBHSDV division factor */
#define PLLUSBCFG_USBHSDV(regval)         (BITS(4,6) & ((uint32_t)(regval) << 4U))
#define RCU_USBHS_DIV2                    PLLUSBCFG_USBHSDV(0)                      /*!< USBHSDV input source clock divided by 2 */
#define RCU_USBHS_DIV4                    PLLUSBCFG_USBHSDV(1)                      /*!< USBHSDV input source clock divided by 4 */
#define RCU_USBHS_DIV6                    PLLUSBCFG_USBHSDV(2)                      /*!< USBHSDV input source clock divided by 6 */
#define RCU_USBHS_DIV8                    PLLUSBCFG_USBHSDV(3)                      /*!< USBHSDV input source clock divided by 8 */
#define RCU_USBHS_DIV10                   PLLUSBCFG_USBHSDV(4)                      /*!< USBHSDV input source clock divided by 10 */
#define RCU_USBHS_DIV12                   PLLUSBCFG_USBHSDV(5)                      /*!< USBHSDV input source clock divided by 12 */
#define RCU_USBHS_DIV14                   PLLUSBCFG_USBHSDV(6)                      /*!< USBHSDV input source clock divided by 14 */
#define RCU_USBHS_DIV16                   PLLUSBCFG_USBHSDV(7)                      /*!< USBHSDV input source clock divided by 16 */

/* PLLUSB clock multiplication factor */
#define PLLUSBCFG_PLLUSBHSMF(regval)      (BITS(8,14) & ((uint32_t)(regval) << 8U))
#define RCU_PLLUSBHS_MUL16                PLLUSBCFG_PLLUSBHSMF(16)                  /*!< PLLUSBHS source clock multiply by 16 */
#define RCU_PLLUSBHS_MUL17                PLLUSBCFG_PLLUSBHSMF(17)                  /*!< PLLUSBHS source clock multiply by 17 */
#define RCU_PLLUSBHS_MUL18                PLLUSBCFG_PLLUSBHSMF(18)                  /*!< PLLUSBHS source clock multiply by 18 */
#define RCU_PLLUSBHS_MUL19                PLLUSBCFG_PLLUSBHSMF(19)                  /*!< PLLUSBHS source clock multiply by 19 */
#define RCU_PLLUSBHS_MUL20                PLLUSBCFG_PLLUSBHSMF(20)                  /*!< PLLUSBHS source clock multiply by 20 */
#define RCU_PLLUSBHS_MUL21                PLLUSBCFG_PLLUSBHSMF(21)                  /*!< PLLUSBHS source clock multiply by 21 */
#define RCU_PLLUSBHS_MUL22                PLLUSBCFG_PLLUSBHSMF(22)                  /*!< PLLUSBHS source clock multiply by 22 */
#define RCU_PLLUSBHS_MUL23                PLLUSBCFG_PLLUSBHSMF(23)                  /*!< PLLUSBHS source clock multiply by 23 */
#define RCU_PLLUSBHS_MUL24                PLLUSBCFG_PLLUSBHSMF(24)                  /*!< PLLUSBHS source clock multiply by 24 */
#define RCU_PLLUSBHS_MUL25                PLLUSBCFG_PLLUSBHSMF(25)                  /*!< PLLUSBHS source clock multiply by 25 */
#define RCU_PLLUSBHS_MUL26                PLLUSBCFG_PLLUSBHSMF(26)                  /*!< PLLUSBHS source clock multiply by 26 */
#define RCU_PLLUSBHS_MUL27                PLLUSBCFG_PLLUSBHSMF(27)                  /*!< PLLUSBHS source clock multiply by 27 */
#define RCU_PLLUSBHS_MUL28                PLLUSBCFG_PLLUSBHSMF(28)                  /*!< PLLUSBHS source clock multiply by 28 */
#define RCU_PLLUSBHS_MUL29                PLLUSBCFG_PLLUSBHSMF(29)                  /*!< PLLUSBHS source clock multiply by 29 */
#define RCU_PLLUSBHS_MUL30                PLLUSBCFG_PLLUSBHSMF(30)                  /*!< PLLUSBHS source clock multiply by 30 */
#define RCU_PLLUSBHS_MUL31                PLLUSBCFG_PLLUSBHSMF(31)                  /*!< PLLUSBHS source clock multiply by 31 */
#define RCU_PLLUSBHS_MUL32                PLLUSBCFG_PLLUSBHSMF(32)                  /*!< PLLUSBHS source clock multiply by 32 */
#define RCU_PLLUSBHS_MUL33                PLLUSBCFG_PLLUSBHSMF(33)                  /*!< PLLUSBHS source clock multiply by 33 */
#define RCU_PLLUSBHS_MUL34                PLLUSBCFG_PLLUSBHSMF(34)                  /*!< PLLUSBHS source clock multiply by 34 */
#define RCU_PLLUSBHS_MUL35                PLLUSBCFG_PLLUSBHSMF(35)                  /*!< PLLUSBHS source clock multiply by 35 */
#define RCU_PLLUSBHS_MUL36                PLLUSBCFG_PLLUSBHSMF(36)                  /*!< PLLUSBHS source clock multiply by 36 */
#define RCU_PLLUSBHS_MUL37                PLLUSBCFG_PLLUSBHSMF(37)                  /*!< PLLUSBHS source clock multiply by 37 */
#define RCU_PLLUSBHS_MUL38                PLLUSBCFG_PLLUSBHSMF(38)                  /*!< PLLUSBHS source clock multiply by 38 */
#define RCU_PLLUSBHS_MUL39                PLLUSBCFG_PLLUSBHSMF(39)                  /*!< PLLUSBHS source clock multiply by 39 */
#define RCU_PLLUSBHS_MUL40                PLLUSBCFG_PLLUSBHSMF(40)                  /*!< PLLUSBHS source clock multiply by 40 */
#define RCU_PLLUSBHS_MUL41                PLLUSBCFG_PLLUSBHSMF(41)                  /*!< PLLUSBHS source clock multiply by 41 */
#define RCU_PLLUSBHS_MUL42                PLLUSBCFG_PLLUSBHSMF(42)                  /*!< PLLUSBHS source clock multiply by 42 */
#define RCU_PLLUSBHS_MUL43                PLLUSBCFG_PLLUSBHSMF(43)                  /*!< PLLUSBHS source clock multiply by 43 */
#define RCU_PLLUSBHS_MUL44                PLLUSBCFG_PLLUSBHSMF(44)                  /*!< PLLUSBHS source clock multiply by 44 */
#define RCU_PLLUSBHS_MUL45                PLLUSBCFG_PLLUSBHSMF(45)                  /*!< PLLUSBHS source clock multiply by 45 */
#define RCU_PLLUSBHS_MUL46                PLLUSBCFG_PLLUSBHSMF(46)                  /*!< PLLUSBHS source clock multiply by 46 */
#define RCU_PLLUSBHS_MUL47                PLLUSBCFG_PLLUSBHSMF(47)                  /*!< PLLUSBHS source clock multiply by 47 */
#define RCU_PLLUSBHS_MUL48                PLLUSBCFG_PLLUSBHSMF(48)                  /*!< PLLUSBHS source clock multiply by 48 */
#define RCU_PLLUSBHS_MUL49                PLLUSBCFG_PLLUSBHSMF(49)                  /*!< PLLUSBHS source clock multiply by 49 */
#define RCU_PLLUSBHS_MUL50                PLLUSBCFG_PLLUSBHSMF(50)                  /*!< PLLUSBHS source clock multiply by 50 */
#define RCU_PLLUSBHS_MUL51                PLLUSBCFG_PLLUSBHSMF(51)                  /*!< PLLUSBHS source clock multiply by 51 */
#define RCU_PLLUSBHS_MUL52                PLLUSBCFG_PLLUSBHSMF(52)                  /*!< PLLUSBHS source clock multiply by 52 */
#define RCU_PLLUSBHS_MUL53                PLLUSBCFG_PLLUSBHSMF(53)                  /*!< PLLUSBHS source clock multiply by 53 */
#define RCU_PLLUSBHS_MUL54                PLLUSBCFG_PLLUSBHSMF(54)                  /*!< PLLUSBHS source clock multiply by 54 */
#define RCU_PLLUSBHS_MUL55                PLLUSBCFG_PLLUSBHSMF(55)                  /*!< PLLUSBHS source clock multiply by 55 */
#define RCU_PLLUSBHS_MUL56                PLLUSBCFG_PLLUSBHSMF(56)                  /*!< PLLUSBHS source clock multiply by 56 */
#define RCU_PLLUSBHS_MUL57                PLLUSBCFG_PLLUSBHSMF(57)                  /*!< PLLUSBHS source clock multiply by 57 */
#define RCU_PLLUSBHS_MUL58                PLLUSBCFG_PLLUSBHSMF(58)                  /*!< PLLUSBHS source clock multiply by 58 */
#define RCU_PLLUSBHS_MUL59                PLLUSBCFG_PLLUSBHSMF(59)                  /*!< PLLUSBHS source clock multiply by 59 */
#define RCU_PLLUSBHS_MUL60                PLLUSBCFG_PLLUSBHSMF(60)                  /*!< PLLUSBHS source clock multiply by 60 */
#define RCU_PLLUSBHS_MUL61                PLLUSBCFG_PLLUSBHSMF(61)                  /*!< PLLUSBHS source clock multiply by 61 */
#define RCU_PLLUSBHS_MUL62                PLLUSBCFG_PLLUSBHSMF(62)                  /*!< PLLUSBHS source clock multiply by 62 */
#define RCU_PLLUSBHS_MUL63                PLLUSBCFG_PLLUSBHSMF(63)                  /*!< PLLUSBHS source clock multiply by 63 */
#define RCU_PLLUSBHS_MUL64                PLLUSBCFG_PLLUSBHSMF(64)                  /*!< PLLUSBHS source clock multiply by 64 */
#define RCU_PLLUSBHS_MUL65                PLLUSBCFG_PLLUSBHSMF(65)                  /*!< PLLUSBHS source clock multiply by 65 */
#define RCU_PLLUSBHS_MUL66                PLLUSBCFG_PLLUSBHSMF(66)                  /*!< PLLUSBHS source clock multiply by 66 */
#define RCU_PLLUSBHS_MUL67                PLLUSBCFG_PLLUSBHSMF(67)                  /*!< PLLUSBHS source clock multiply by 67 */
#define RCU_PLLUSBHS_MUL68                PLLUSBCFG_PLLUSBHSMF(68)                  /*!< PLLUSBHS source clock multiply by 68 */
#define RCU_PLLUSBHS_MUL69                PLLUSBCFG_PLLUSBHSMF(69)                  /*!< PLLUSBHS source clock multiply by 69 */
#define RCU_PLLUSBHS_MUL70                PLLUSBCFG_PLLUSBHSMF(70)                  /*!< PLLUSBHS source clock multiply by 70 */
#define RCU_PLLUSBHS_MUL71                PLLUSBCFG_PLLUSBHSMF(71)                  /*!< PLLUSBHS source clock multiply by 71 */
#define RCU_PLLUSBHS_MUL72                PLLUSBCFG_PLLUSBHSMF(72)                  /*!< PLLUSBHS source clock multiply by 72 */
#define RCU_PLLUSBHS_MUL73                PLLUSBCFG_PLLUSBHSMF(73)                  /*!< PLLUSBHS source clock multiply by 73 */
#define RCU_PLLUSBHS_MUL74                PLLUSBCFG_PLLUSBHSMF(74)                  /*!< PLLUSBHS source clock multiply by 74 */
#define RCU_PLLUSBHS_MUL75                PLLUSBCFG_PLLUSBHSMF(75)                  /*!< PLLUSBHS source clock multiply by 75 */
#define RCU_PLLUSBHS_MUL76                PLLUSBCFG_PLLUSBHSMF(76)                  /*!< PLLUSBHS source clock multiply by 76 */
#define RCU_PLLUSBHS_MUL77                PLLUSBCFG_PLLUSBHSMF(77)                  /*!< PLLUSBHS source clock multiply by 77 */
#define RCU_PLLUSBHS_MUL78                PLLUSBCFG_PLLUSBHSMF(78)                  /*!< PLLUSBHS source clock multiply by 78 */
#define RCU_PLLUSBHS_MUL79                PLLUSBCFG_PLLUSBHSMF(79)                  /*!< PLLUSBHS source clock multiply by 79 */
#define RCU_PLLUSBHS_MUL80                PLLUSBCFG_PLLUSBHSMF(80)                  /*!< PLLUSBHS source clock multiply by 80 */
#define RCU_PLLUSBHS_MUL81                PLLUSBCFG_PLLUSBHSMF(81)                  /*!< PLLUSBHS source clock multiply by 81 */
#define RCU_PLLUSBHS_MUL82                PLLUSBCFG_PLLUSBHSMF(82)                  /*!< PLLUSBHS source clock multiply by 82 */
#define RCU_PLLUSBHS_MUL83                PLLUSBCFG_PLLUSBHSMF(83)                  /*!< PLLUSBHS source clock multiply by 83 */
#define RCU_PLLUSBHS_MUL84                PLLUSBCFG_PLLUSBHSMF(84)                  /*!< PLLUSBHS source clock multiply by 84 */
#define RCU_PLLUSBHS_MUL85                PLLUSBCFG_PLLUSBHSMF(85)                  /*!< PLLUSBHS source clock multiply by 85 */
#define RCU_PLLUSBHS_MUL86                PLLUSBCFG_PLLUSBHSMF(86)                  /*!< PLLUSBHS source clock multiply by 86 */
#define RCU_PLLUSBHS_MUL87                PLLUSBCFG_PLLUSBHSMF(87)                  /*!< PLLUSBHS source clock multiply by 87 */
#define RCU_PLLUSBHS_MUL88                PLLUSBCFG_PLLUSBHSMF(88)                  /*!< PLLUSBHS source clock multiply by 88 */
#define RCU_PLLUSBHS_MUL89                PLLUSBCFG_PLLUSBHSMF(89)                  /*!< PLLUSBHS source clock multiply by 89 */
#define RCU_PLLUSBHS_MUL90                PLLUSBCFG_PLLUSBHSMF(90)                  /*!< PLLUSBHS source clock multiply by 90 */
#define RCU_PLLUSBHS_MUL91                PLLUSBCFG_PLLUSBHSMF(91)                  /*!< PLLUSBHS source clock multiply by 91 */
#define RCU_PLLUSBHS_MUL92                PLLUSBCFG_PLLUSBHSMF(92)                  /*!< PLLUSBHS source clock multiply by 92 */
#define RCU_PLLUSBHS_MUL93                PLLUSBCFG_PLLUSBHSMF(93)                  /*!< PLLUSBHS source clock multiply by 93 */
#define RCU_PLLUSBHS_MUL94                PLLUSBCFG_PLLUSBHSMF(94)                  /*!< PLLUSBHS source clock multiply by 94 */
#define RCU_PLLUSBHS_MUL95                PLLUSBCFG_PLLUSBHSMF(95)                  /*!< PLLUSBHS source clock multiply by 95 */
#define RCU_PLLUSBHS_MUL96                PLLUSBCFG_PLLUSBHSMF(96)                  /*!< PLLUSBHS source clock multiply by 96 */
#define RCU_PLLUSBHS_MUL97                PLLUSBCFG_PLLUSBHSMF(97)                  /*!< PLLUSBHS source clock multiply by 97 */
#define RCU_PLLUSBHS_MUL98                PLLUSBCFG_PLLUSBHSMF(98)                  /*!< PLLUSBHS source clock multiply by 98 */
#define RCU_PLLUSBHS_MUL99                PLLUSBCFG_PLLUSBHSMF(99)                  /*!< PLLUSBHS source clock multiply by 99 */
#define RCU_PLLUSBHS_MUL100               PLLUSBCFG_PLLUSBHSMF(100)                 /*!< PLLUSBHS source clock multiply by 100 */
#define RCU_PLLUSBHS_MUL101               PLLUSBCFG_PLLUSBHSMF(101)                 /*!< PLLUSBHS source clock multiply by 101 */
#define RCU_PLLUSBHS_MUL102               PLLUSBCFG_PLLUSBHSMF(102)                 /*!< PLLUSBHS source clock multiply by 102 */
#define RCU_PLLUSBHS_MUL103               PLLUSBCFG_PLLUSBHSMF(103)                 /*!< PLLUSBHS source clock multiply by 103 */
#define RCU_PLLUSBHS_MUL104               PLLUSBCFG_PLLUSBHSMF(104)                 /*!< PLLUSBHS source clock multiply by 104 */
#define RCU_PLLUSBHS_MUL105               PLLUSBCFG_PLLUSBHSMF(105)                 /*!< PLLUSBHS source clock multiply by 105 */
#define RCU_PLLUSBHS_MUL106               PLLUSBCFG_PLLUSBHSMF(106)                 /*!< PLLUSBHS source clock multiply by 106 */
#define RCU_PLLUSBHS_MUL107               PLLUSBCFG_PLLUSBHSMF(107)                 /*!< PLLUSBHS source clock multiply by 107 */
#define RCU_PLLUSBHS_MUL108               PLLUSBCFG_PLLUSBHSMF(108)                 /*!< PLLUSBHS source clock multiply by 108 */
#define RCU_PLLUSBHS_MUL109               PLLUSBCFG_PLLUSBHSMF(109)                 /*!< PLLUSBHS source clock multiply by 109 */
#define RCU_PLLUSBHS_MUL110               PLLUSBCFG_PLLUSBHSMF(110)                 /*!< PLLUSBHS source clock multiply by 110 */
#define RCU_PLLUSBHS_MUL111               PLLUSBCFG_PLLUSBHSMF(111)                 /*!< PLLUSBHS source clock multiply by 111 */
#define RCU_PLLUSBHS_MUL112               PLLUSBCFG_PLLUSBHSMF(112)                 /*!< PLLUSBHS source clock multiply by 112 */
#define RCU_PLLUSBHS_MUL113               PLLUSBCFG_PLLUSBHSMF(113)                 /*!< PLLUSBHS source clock multiply by 113 */
#define RCU_PLLUSBHS_MUL114               PLLUSBCFG_PLLUSBHSMF(114)                 /*!< PLLUSBHS source clock multiply by 114 */
#define RCU_PLLUSBHS_MUL115               PLLUSBCFG_PLLUSBHSMF(115)                 /*!< PLLUSBHS source clock multiply by 115 */
#define RCU_PLLUSBHS_MUL116               PLLUSBCFG_PLLUSBHSMF(116)                 /*!< PLLUSBHS source clock multiply by 116 */
#define RCU_PLLUSBHS_MUL117               PLLUSBCFG_PLLUSBHSMF(117)                 /*!< PLLUSBHS source clock multiply by 117 */
#define RCU_PLLUSBHS_MUL118               PLLUSBCFG_PLLUSBHSMF(118)                 /*!< PLLUSBHS source clock multiply by 118 */
#define RCU_PLLUSBHS_MUL119               PLLUSBCFG_PLLUSBHSMF(119)                 /*!< PLLUSBHS source clock multiply by 119 */
#define RCU_PLLUSBHS_MUL120               PLLUSBCFG_PLLUSBHSMF(120)                 /*!< PLLUSBHS source clock multiply by 120 */
#define RCU_PLLUSBHS_MUL121               PLLUSBCFG_PLLUSBHSMF(121)                 /*!< PLLUSBHS source clock multiply by 121 */
#define RCU_PLLUSBHS_MUL122               PLLUSBCFG_PLLUSBHSMF(122)                 /*!< PLLUSBHS source clock multiply by 122 */
#define RCU_PLLUSBHS_MUL123               PLLUSBCFG_PLLUSBHSMF(123)                 /*!< PLLUSBHS source clock multiply by 123 */
#define RCU_PLLUSBHS_MUL124               PLLUSBCFG_PLLUSBHSMF(124)                 /*!< PLLUSBHS source clock multiply by 124 */
#define RCU_PLLUSBHS_MUL125               PLLUSBCFG_PLLUSBHSMF(125)                 /*!< PLLUSBHS source clock multiply by 125 */
#define RCU_PLLUSBHS_MUL126               PLLUSBCFG_PLLUSBHSMF(126)                 /*!< PLLUSBHS source clock multiply by 126 */
#define RCU_PLLUSBHS_MUL127               PLLUSBCFG_PLLUSBHSMF(127)                 /*!< PLLUSBHS source clock multiply by 127 */

